tap "homebrew/bundle"
tap "homebrew/services"
tap "shivammathur/php"
tap "typesense/tap"
brew "libtiff"
brew "jpeg-xl"
brew "cmatrix"
brew "php", restart_service: true
brew "composer"
brew "fnm"
brew "gh"
brew "git"
brew "gnupg"
brew "htop"
brew "lazygit"
brew "lf"
brew "mysql", restart_service: true
brew "node"
brew "phive"
brew "php@8.2"
brew "phpunit"
brew "pyenv"
brew "stow"
brew "watch"
brew "wp-cli"
brew "yarn"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "shivammathur/php/php@7.4"
brew "typesense/tap/typesense-server@27.0"
cask "1password"
cask "firefox"
cask "google-chrome"
cask "gulp"
cask "iterm2"
cask "libreoffice"
cask "local"
cask "microsoft-edge"
cask "onedrive"
cask "opera"
cask "slack"
cask "spotify"
cask "tableplus"
cask "transmit"
cask "visual-studio-code"
cask "vlc"
cask "vnc-viewer"
vscode "anthonydiametrix.acf-snippet"
vscode "bmewburn.vscode-intelephense-client"
vscode "claudiosanches.woocommerce"
vscode "devsense.composer-php-vscode"
vscode "eamodio.gitlens"
vscode "emallin.phpunit"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "mblode.twig-language-2"
vscode "mehedidracula.php-namespace-resolver"
vscode "mikestead.dotenv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-vscode.makefile-tools"
vscode "neilbrayfield.php-docblocker"
vscode "redhat.vscode-xml"
vscode "seatonjiang.gitmoji-vscode"
vscode "svelte.svelte-vscode"
vscode "wordpresstoolbox.wordpress-toolbox"
vscode "xdebug.php-debug"
