tap "homebrew/bundle"
tap "homebrew/services"
tap "shivammathur/php"
tap "typesense/tap"
brew "libtiff"
brew "jpeg-xl"
brew "btop"
brew "cmatrix"
brew "php", restart_service: :changed
brew "composer"
brew "coreutils"
brew "dnsmasq"
brew "fnm"
brew "gh"
brew "git"
brew "gnupg"
brew "jq"
brew "lazygit"
brew "mysql", restart_service: :changed, link: false
brew "mysql@8.0", restart_service: :changed, link: true
brew "mysql@8.4"
brew "nginx"
brew "node"
brew "phive"
brew "php@8.2"
brew "php@8.3", restart_service: :changed
brew "phpunit"
brew "pyenv"
brew "stow"
brew "watch"
brew "wimlib"
brew "yarn"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "shivammathur/php/php@7.4"
brew "typesense/tap/typesense-server@28.0", link: false
cask "1password"
cask "balenaetcher"
cask "cursor"
cask "figma"
cask "kdenlive"
cask "libreoffice"
cask "local"
cask "raycast"
cask "slack"
cask "spotify"
cask "tableplus"
cask "transmit"
cask "visual-studio-code"
cask "wezterm"
cask "zen"
vscode "aaron-bond.better-comments"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "claudiosanches.woocommerce"
vscode "dominicvonk.inlay-hints"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "jbockle.jbockle-format-files"
vscode "kamikillerto.vscode-colorize"
vscode "kricsleo.vscode-package-json-inspector"
vscode "mblode.twig-language-2"
vscode "mehedidracula.php-namespace-resolver"
vscode "mikestead.dotenv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "mrmlnc.vscode-scss"
vscode "ms-vscode.makefile-tools"
vscode "neilbrayfield.php-docblocker"
vscode "onecentlin.laravel-blade"
vscode "redhat.vscode-xml"
vscode "sanderronde.phpstan-vscode"
vscode "seatonjiang.gitmoji-vscode"
vscode "svelte.svelte-vscode"
vscode "yinfei.luahelper"
